#### BuiltInFailures.RoomFailures Members

---

|  |
| --- |
| BuiltInFailures RoomFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures RoomFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | AreaTagBadViewType | Can't Copy Area Tags. The target view doesn't have the same Area Scheme as the original view. |
| Public property Static member | AreaUnplaceWarning | An Area was deleted from all model views but still remains in this project. \n The area can be removed from any schedule or placed back in the model using the Area command. |
| Public property Static member | CannotMakeRoomsGeometry | Could not create geometry for [Room]. |
| Public property Static member | ExtensionsOverlapWarning | Vertical Extensions on these Walls overlap. This can cause undesirable Joins. Try starting with no overlap and extend the Walls toward one another. |
| Public property Static member | InvalidReflectivityPercentage | The value for Reflectivity must be between 0 and 1. |
| Public property Static member | InvisibleRoomBoundElemement | [Room] Bounding element is invisible in current view. |
| Public property Static member | OptionConflictBoundariesVaryMainAddToOptionSet | Option Conflict between Rooms.\nRoom boundary in the Main Model differs from the apparent boundary in view '[View Name]'.\nTo resolve, select the Main Model Room and use the Add to Design Option Set command. |
| Public property Static member | OptionConflictBoundariesVaryMainSeparate | Option Conflict between Rooms.\nRoom boundary in the Main Model differs from the apparent boundary in view '[View Name]'.\nTo resolve, divide space with Room Separation Lines in the Main Model. |
| Public property Static member | OptionConflictBoundariesVaryOptionSeparate | Option Conflict between Rooms.\nRoom boundary differs from the apparent boundary in view '[View Name]'.\nTo resolve, divide space with Room Separation Lines in the Main Model. |
| Public property Static member | OptionConflictInLinkBoundariesVaryMainAddToOptionSet | Option conflict between rooms in the Revit link '[Link Instance Name]'.\nThe room boundary in the main model of the Revit link differs from the apparent boundary in the linked view '[View Name from Link]'.\nTo resolve the issue, open the Revit link file for editing, select the main model room, and use the Add to Design Option Set tool. |
| Public property Static member | OptionConflictInLinkBoundariesVaryMainSeparate | Option conflict between rooms in the Revit link '[Link Instance Name]'.\nThe room boundary in the main model of the Revit link differs from the apparent boundary in the linked view '[View Name from Link]'.\nTo resolve the issue, open the Revit link file for editing, and use room separation lines to divide the space in the main model. |
| Public property Static member | OptionConflictInLinkBoundariesVaryOptionSeparate | Option conflict between rooms in the Revit link '[Link Instance Name]'.\nThe room boundary differs from the apparent boundary in the linked view '[View Name from Link]'.\nTo resolve the issue, open the Revit link file for editing, and use room separation lines to divide the space in the main model. |
| Public property Static member | OptionConflictInLinkRoomOverlapMain | Option conflict between rooms in the Revit link '[Link Instance Name]'.\nThe room in the Revit link's option '[Option Name in Link]' overlaps a room in the main model.\nTo resolve the issue, open the Revit link file for editing, select the main model room, and use the Add to Design Option Set tool. |
| Public property Static member | OptionConflictInLinkRoomOverlapOption | Option conflict between rooms in the Revit link '[Link Instance Name]'.\nA room in the Revit link's option '[Option #1 Name in Link]' overlaps a room in the Revit link's option '[Option #2 Name in Link]'.\nTo resolve the issue, open the Revit link file for editing, and delete the duplicate room or use room separation lines to divide the space in the main model. |
| Public property Static member | OptionConflictRoomOverlapMain | Option Conflict between Rooms.\nRoom in Option '[Option Name]' overlaps Room in the Main Model.\nTo resolve, select the Main Model Room and use the Add to Design Option Set command. |
| Public property Static member | OptionConflictRoomOverlapOption | Option Conflict between Rooms.\nRoom in Option '[Option Name]' overlaps Room in Option '[Option Name]'.\nTo resolve, delete the duplicate Room or divide space with Room Separation Lines in the Main Model. |
| Public property Static member | RoomBaseAboveComputationHeight | [RoomBase]'s lower offset is above the Computation Height |
| Public property Static member | RoomBelowCompHeight | [Room] Volume is being calculated above the Upper Limit of this [Room]. Change the Upper Limit and Offset or change the height of volume calculations. |
| Public property Static member | RoomBoundaryMisalignment | [Room] bounding element might be misaligned. |
| Public property Static member | RoomHeightNegative | [Room] must have a height greater than 0. |
| Public property Static member | RoomLevelElevs | A [Room]s Upper Limit must be above its Base Level. |
| Public property Static member | RoomNotEnclosed | [Room] is not in a properly enclosed region |
| Public property Static member | RoomNotEnclosedAreas | [Room] is not in a properly enclosed region |
| Public property Static member | RoomNotEnclosedLoadAreas | [Room] is not in a properly enclosed region |
| Public property Static member | RoomNotEnclosedRooms | [Room] is not in a properly enclosed region |
| Public property Static member | RoomNotEnclosedSpaces | [Room] is not in a properly enclosed region |
| Public property Static member | RoomsCreatedAutomatically | [Room] [Room] created automatically. |
| Public property Static member | RoomsFailed | [Room] computations only succeeded without considering the following elements. |
| Public property Static member | RoomsInSameRegion | Multiple [Room] are in the same enclosed region. The correct area and perimeter will be assigned to one [Room] and the others will display "Redundant [Room]." You should separate the regions, delete the extra [Room], or move them into different regions. |
| Public property Static member | RoomsInSameRegionAreas | Multiple [Room] are in the same enclosed region. The correct area and perimeter will be assigned to one [Room] and the others will display "Redundant [Room]." You should separate the regions, delete the extra [Room], or move them into different regions. |
| Public property Static member | RoomsInSameRegionLoadAreas | Multiple [Room] are in the same enclosed region. The correct area and perimeter will be assigned to one [Room] and the others will display "Redundant [Room]." You should separate the regions, delete the extra [Room], or move them into different regions. |
| Public property Static member | RoomsInSameRegionRooms | Multiple [Room] are in the same enclosed region. The correct area and perimeter will be assigned to one [Room] and the others will display "Redundant [Room]." You should separate the regions, delete the extra [Room], or move them into different regions. |
| Public property Static member | RoomsInSameRegionSpaces | Multiple [Room] are in the same enclosed region. The correct area and perimeter will be assigned to one [Room] and the others will display "Redundant [Room]." You should separate the regions, delete the extra [Room], or move them into different regions. |
| Public property Static member | RoomsOverlapInHeight | [Room] volumes overlap. Adjust the Upper Limit and Limit Offset properties of the [rooms]. |
| Public property Static member | RoomsReallyFailed | [Room] computations failed. Try to modify the following elements. |
| Public property Static member | RoomTagBadViewType | [Room] Tags can only be placed in Floor Plan, Reflected Ceiling Plan and Section Views. |
| Public property Static member | RoomTagDeleted | A [Room] Tag was deleted, but the corresponding [Room] still exists. You can place another tag for the [Room] using the [Room] Tag tool or select the [Room] and delete it. |
| Public property Static member | RoomTagNotInRoom | [Room] Tag is outside of its [Room]. Enable Leader or move [Room] Tag within its [Room]. |
| Public property Static member | RoomTagNotInRoomToArea | [Room] Tag is outside of its [Room]. Enable Leader or move [Room] Tag within its [Room]. |
| Public property Static member | RoomTagNotInRoomToRoom | [Room] Tag is outside of its [Room]. Enable Leader or move [Room] Tag within its [Room]. |
| Public property Static member | RoomTagNotInRoomToSpace | [Room] Tag is outside of its [Room]. Enable Leader or move [Room] Tag within its [Room]. |
| Public property Static member | RoomTagVolumeNotComputed | [Room] Tag is displaying volume that can't be computed. |
| Public property Static member | RoomTooShort | [Room] is very short. If this is not intended, change its Upper Limit and Offset. |
| Public property Static member | RoomUnplaceWarning | A Room was deleted from all model views but still remains in this project. \n The room can be removed from any schedule or placed back in the model using the Room command. |
| Public property Static member | ShowRoomBoundingElements | [Room] Bounding elements are highlighted. |
| Public property Static member | SpaceUnplaceWarning | A Space was deleted from all model views but still remains in this project. \n The Space can be removed from any schedule or placed back in the model using the Space command. |

# See Also

BuiltInFailures RoomFailures Class

Autodesk.Revit.DB Namespace